# StairsSupporttypeTotalDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupporttypeTotalDepth Property
ParameterTypeId Class See Also
---
"Total Depth": Total Depth
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupporttypeTotalDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupporttypeTotalDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupporttypeTotalDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace